## Задание 1

* Определите, какому фильму было выставлено больше всего оценок 5.0.

In [2]:
import pandas as pd

In [3]:
ratings = pd.read_csv('ratings.csv')

In [4]:
ratings.head()

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [5]:
ratings['movieId'].nunique()

59047

In [7]:
movies = pd.read_csv('movies.csv')

In [8]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [9]:
movies['movieId'].nunique()

62423

In [10]:
joined_movies = ratings.merge(movies, on='movieId', how='left')

In [11]:
joined_movies.head()

,userId,movieId,rating,timestamp,title,genres
0,1,296,5.0,1147880044,Pulp Fiction (1994),Comedy|Crime|Drama|Thriller
1,1,306,3.5,1147868817,Three Colors: Red (Trois couleurs: Rouge) (1994),Drama
2,1,307,5.0,1147868828,Three Colors: Blue (Trois couleurs: Bleu) (1993),Drama
3,1,665,5.0,1147878820,Underground (1995),Comedy|Drama|War
4,1,899,3.5,1147868510,Singin' in the Rain (1952),Comedy|Musical|Romance

In [12]:
filtred_ratings = joined_movies[['rating', 'title']]

In [13]:
filtred_ratings.head()

   rating                                             title
0     5.0                               Pulp Fiction (1994)
1     3.5  Three Colors: Red (Trois couleurs: Rouge) (1994)
2     5.0  Three Colors: Blue (Trois couleurs: Bleu) (1993)
3     5.0                                Underground (1995)
4     3.5                        Singin' in the Rain (1952)

In [18]:
answear = filtred_ratings.sort_values(by=['rating', 'title'], ascending=[True, True])

In [19]:
answear.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 25000095 entries, 1287662 to 10124644
Data columns (total 2 columns):
 #   Column  Dtype
---  ------  -----
 0   rating  float64
 1   title   object
dtypes: float64(1), object(1)
memory usage: 572.2+ MB

In [20]:
answear[answear['rating'] == 5.0]

          rating                                              title
3383363      5.0                   "Great Performances" Cats (1998)
3465295      5.0                   "Great Performances" Cats (1998)
4395396      5.0                   "Great Performances" Cats (1998)
5690046      5.0                   "Great Performances" Cats (1998)
6163429      5.0                   "Great Performances" Cats (1998)
...          ...                                                ...
22983120     5.0                                     Я худею (2018)
11142141     5.0  ‘Rameau’s Nephew’ by Diderot (Thanx to Dennis ...
3938227      5.0                                     チェブラーシカ (2010)
11614161     5.0                                        貞子3D (2012)
10124644     5.0                                        줄탁동시 (2012)

[3612474 rows x 2 columns]

In [21]:
five = answear.title.value_counts()

In [24]:
five

Forrest Gump (1994)                 81491
Shawshank Redemption, The (1994)    81482
Pulp Fiction (1994)                 79672
Silence of the Lambs, The (1991)    74127
Matrix, The (1999)                  72674
                                    ...
Joni (1979)                             1
Jordy in Transitland (2016)             1
Shadows Run Black (1984)                1
João, O Maestro (2017)                  1
Zum Teufel mit der Penne (1968)         1
Name: title, Length: 58958, dtype: int64

## Задание 2
* По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [4]:
power = pd.read_csv('/home/max/jupyter/jupyter_learning/numpy_pandas/ДЗ/DZ_10_files/power.csv')

In [5]:
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [6]:
power[ power['country'].str.contains('ia', case=False) ]['country'].unique()

array(['Austria', 'Czechia', 'Romania', 'Serbia', 'Slovakia', 'Bulgaria',
       'Croatia', 'Lithuania', 'Other Asia', 'T.F.Yug.Rep. Macedonia',
       'Colombia', 'Australia', 'Ethiopia', 'Serbia and Montenegro',
       'Tunisia', 'Georgia', 'Latvia', 'Armenia', 'Russian Federation',
       'Bolivia (Plur. State of)', 'Estonia', 'Ethiopia, incl. Eritrea',
       'French Guiana', 'Indonesia', 'Liberia', 'Malaysia', 'Mauritania',
       'Namibia', 'New Caledonia', 'Slovenia', 'United Rep. of Tanzania',
       'Yugoslavia, SFR (former)', 'Zambia', 'Algeria',
       'French Polynesia', 'Syrian Arab Republic', 'India', 'Nigeria',
       'Somalia', 'Albania', 'Bosnia and Herzegovina',
       'Czechoslovakia (former)', 'Equatorial Guinea', 'Saudi Arabia',
       'St. Lucia', 'Mongolia', 'Cambodia', 'Gambia',
       'Micronesia (Fed. States of)', 'Northern Mariana Islands'],
      dtype=object)

In [7]:
baltic_states = power[ 
    (power['country'] == 'Latvia')  | (power['country'] == 'Lithuania') | (power['country'] == 'Estonia')
        ]

In [8]:
baltic_states['country'].unique()

array(['Lithuania', 'Latvia', 'Estonia'], dtype=object)

In [14]:
power[ 
    ((power['country'] == 'Latvia')  | (power['country'] == 'Lithuania') | (power['country'] == 'Estonia')) 
    &
    ((power['category'] == 4)  | (power['category'] == 12) | (power['category'] == 21)) 
    &
    ((power['year'] >= 2005) | (power['year']<= 2010))
    &
    (power['quantity'] >= 0)
        ]

          country  year  quantity  category
10617     Estonia  2008       1.0         4
10618     Estonia  2007       0.0         4
10619     Estonia  2006       0.0         4
10620     Estonia  2005       1.0         4
10621     Estonia  2004       1.0         4
...           ...   ...       ...       ...
253986  Lithuania  2005       1.0        21
253987  Lithuania  2004       1.0        21
253988  Lithuania  2003       0.0        21
253989  Lithuania  2002       0.0        21
253990  Lithuania  2001       0.0        21

[1245 rows x 4 columns]

In [18]:
power['quantity'].sum()

219179627208.76712

## Задине 3
* Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe. Примеры страниц (необязательно брать именно эти):

In [19]:
bitcoin_url = 'https://fortrader.org/cryptocurrencies'

In [23]:
#df = pd.read_html(bitcoin_url, attrs = {'class': 'crypto__table'}, encoding='utf-8')

In [25]:
df = pd.read_html('https://fortrader.org/cryptocurrencies')[0]
df

                                      0            1       2
0           BTC/USDБиткоин / Доллар США  44838.00000  +6.37%
1              DSH/USDDash / Доллар США    128.04000  -1.48%
2            XRP/USDRipple / Доллар США      0.83831  -0.56%
3           ETH/USDЭфириум / Доллар США   3170.96000  +7.66%
4               NEO/USDNEO / Доллар США     24.75400  +1.47%
5               EOS/USDEOS / Доллар США      2.52620  -0.57%
6            XMR/USDMonero / Доллар США    202.25000  -0.82%
7             IOTA/USDIOTA / Доллар США      0.80783  +0.35%
8          LTC/USDLitecoin / Dollar USA    126.45000  +0.01%
9   ETC/USDEthereum Classic / US Dollar     48.29300  -0.52%
10     BCH/USDBitcoin Cash / Доллар США    361.85000  -0.87%
11                                 moex     95.51000   0.00%